"%[All]@ of the following are true" = "%1$[All]@ of the following are true";
"%[Any]@ of the following are true" = "%1$[Any]@ of the following are true";
"%[None]@ of the following are true" = "%1$[None]@ of the following are true";

"%[lastPathComponent]@ %[contains]@ %@" = "%1$[Name]@ %2$[contains]@ %3$@";
"%[lastPathComponent]@ %[is]@ %@" = "%1$[Name]@ %2$[is]@ %3$@";
"%[lastPathComponent]@ %[is not]@ %@" = "%1$[Name]@ %2$[is not]@ %3$@";
"%[lastPathComponent]@ %[begins with]@ %@" = "%1$[Name]@ %2$[begins with]@ %3$@";
"%[lastPathComponent]@ %[ends with]@ %@" = "%1$[Name]@ %2$[ends with]@ %3$@";

"%[self]@ %[contains]@ %@" = "%1$[Path]@ %2$[contains]@ %3$@";
"%[self]@ %[is]@ %@" = "%1$[Path]@ %2$[is]@ %3$@";
"%[self]@ %[is not]@ %@" = "%1$[Path]@ %2$[is not]@ %3$@";
"%[self]@ %[begins with]@ %@" = "%1$[Path]@ %2$[begins with]@ %3$@";
"%[self]@ %[ends with]@ %@" = "%1$[Path]@ %2$[ends with]@ %3$@";

"%[pathExtension]@ %[contains]@ %@" = "%1$[Extension]@ %2$[contains]@ %3$@";
"%[pathExtension]@ %[is]@ %@" = "%1$[Extension]@ %2$[is]@ %3$@";
"%[pathExtension]@ %[is not]@ %@" = "%1$[Extension]@ %2$[is not]@ %3$@";
"%[pathExtension]@ %[begins with]@ %@" = "%1$[Extension]@ %2$[begins with]@ %3$@";
"%[pathExtension]@ %[ends with]@ %@" = "%1$[Extension]@ %2$[ends with]@ %3$@";
